---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.UnconstrainableRebarHandle
source: html/893f78f6-a578-05b4-6537-fe59ecad4229.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.UnconstrainableRebarHandle Property

The rebar handle does not have any constraint targets.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnconstrainableRebarHandle { get; }
```